Revit 2027 API
CoordinationModelLinkData.GetCategoryNames Method
 Return the category names of all elements inside the current Coordination Model Link from Autodesk Docs.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<string> GetCategoryNames()
Public Function GetCategoryNames As IList(Of String)
public:
IList<String^>^ GetCategoryNames()
member GetCategoryNames : unit -> IList<string>
Return Value
IList<String>
 Returns an array of category names for elements inside a Coordination Model from Autodesk Docs. Returns an empty array for a local Coordination Model.
Remarks
 Categories of elements inside a Coordination Model from Autodesk Docs are not Revit categories.
 The category names are taken from the source of the Coordination Model and aren't localized in Revit. For example: If the source of the Coordination Model is in Chinese, the category names will always be in Chinese in Revit, regardless of the Revit language settings.
 For a Coordination Model from Autodesk Docs, it returns the array of strings representing the category names of elements inside the Coordination Model.
 For a local Coordination Model, it returns an empty array.
See Also
Reference
CoordinationModelLinkData Class
Autodesk.Revit.DB.ExternalData Namespace